#pragma once
#include <Arduino.h>

/* =========================================================
   ПОДІЇ КЕРУВАННЯ
   ========================================================= */

enum ControlEvent
{
    CTRL_NONE,

    // кнопка 1 (та, що вже є)
    CTRL_BTN1_TAP,
    CTRL_BTN1_HOLD,
};

/* =========================================================
   API МОДУЛЯ КЕРУВАННЯ
   ========================================================= */

// ініціалізація кнопок, пінів і т.д.
void Controls_Init();

// оновлення стану кнопок, повертає подію (якщо є)
ControlEvent Controls_Update();