#pragma once
#include <Arduino.h>

/* =========================================================
   ПОДІЇ КЕРУВАННЯ
   ========================================================= */

enum ControlEvent
{
    CTRL_NONE,

    // кнопка живлення / RGB (є зараз)
    CTRL_BTN_POWER_TAP,
    CTRL_BTN_POWER_HOLD,
};

/* =========================================================
   API МОДУЛЯ КЕРУВАННЯ
   ========================================================= */

// ініціалізація кнопок, пінів і т.д.
void Controls_Init();

// оновлення стану кнопок, повертає подію (якщо є)
ControlEvent Controls_Update();