#pragma once
#include <Arduino.h>

/* =========================================================
   ПОДІЇ КЕРУВАННЯ
   ========================================================= */

enum ControlEvent
{
    CTRL_NONE,
    CTRL_NEXT_MODE,
    CTRL_TOGGLE_POWER
};

/* =========================================================
   API МОДУЛЯ КЕРУВАННЯ
   ========================================================= */

// ініціалізація кнопок, пінів і т.д.
void Controls_Init();

// оновлення стану кнопок, повертає подію (якщо є)
ControlEvent Controls_Update();